//
// Copyright Neil McGill, goblinhack@gmail.com
//

#include "my_main.hpp"
#include "my_sys.hpp"
#include "my_unicode.hpp"

wchar_t unicode_alias_to_char(const std::string &s)
{
  TRACE_AND_INDENT();

  if (s == "space") {
    return UNICODE_SPACE;
  }
  if (s == "exclamation_mark") {
    return UNICODE_EXCLAMATION_MARK;
  }
  if (s == "double_quote") {
    return UNICODE_DOUBLE_QUOTE;
  }
  if (s == "number") {
    return UNICODE_NUMBER;
  }
  if (s == "dollar") {
    return UNICODE_DOLLAR;
  }
  if (s == "percent") {
    return UNICODE_PERCENT;
  }
  if (s == "ampersand") {
    return UNICODE_AMPERSAND;
  }
  if (s == "single_quote") {
    return UNICODE_SINGLE_QUOTE;
  }
  if (s == "left_parenthesis") {
    return UNICODE_LEFT_PARENTHESIS;
  }
  if (s == "right_parenthesis") {
    return UNICODE_RIGHT_PARENTHESIS;
  }
  if (s == "asterisk") {
    return UNICODE_ASTERISK;
  }
  if (s == "plus") {
    return UNICODE_PLUS;
  }
  if (s == "comma") {
    return UNICODE_COMMA;
  }
  if (s == "minus") {
    return UNICODE_MINUS;
  }
  if (s == "period") {
    return UNICODE_PERIOD;
  }
  if (s == "slash") {
    return UNICODE_SLASH;
  }
  if (s == "zero") {
    return UNICODE_ZERO;
  }
  if (s == "one") {
    return UNICODE_ONE;
  }
  if (s == "two") {
    return UNICODE_TWO;
  }
  if (s == "three") {
    return UNICODE_THREE;
  }
  if (s == "four") {
    return UNICODE_FOUR;
  }
  if (s == "five") {
    return UNICODE_FIVE;
  }
  if (s == "six") {
    return UNICODE_SIX;
  }

  if (s == "four_dots") {
    return UNICODE_ALIAS_FOR_FOUR_DOTS;
  }
  if (s == "diamond") {
    return UNICODE_ALIAS_FOR_DIAMOND;
  }
  if (s == "inverted_v") {
    return UNICODE_ALIAS_FOR_INVERTED_V;
  }
  if (s == "aries") {
    return UNICODE_ALIAS_FOR_ARIES;
  }
  if (s == "ankh") {
    return UNICODE_ALIAS_FOR_ANKH;
  }
  if (s == "music_note") {
    return UNICODE_ALIAS_FOR_MUSIC_NOTE;
  }
  if (s == "circle") {
    return UNICODE_ALIAS_FOR_CIRCLE;
  }
  if (s == "solid_circle") {
    return UNICODE_ALIAS_FOR_SOLID_CIRCLE;
  }
  if (s == "lollipop") {
    return UNICODE_ALIAS_FOR_LOLLIPOP;
  }
  if (s == "three_dots") {
    return UNICODE_ALIAS_FOR_THREE_DOTS;
  }
  if (s == "up_arrow") {
    return UNICODE_ALIAS_FOR_UP_ARROW;
  }
  if (s == "down_arrow") {
    return UNICODE_ALIAS_FOR_DOWN_ARROW;
  }
  if (s == "left_arrow") {
    return UNICODE_ALIAS_FOR_LEFT_ARROW;
  }
  if (s == "right_arrow") {
    return UNICODE_ALIAS_FOR_RIGHT_ARROW;
  }
  if (s == "up_triangle") {
    return UNICODE_ALIAS_FOR_UP_TRIANGLE;
  }
  if (s == "down_triangle") {
    return UNICODE_ALIAS_FOR_DOWN_TRIANGLE;
  }
  if (s == "omega") {
    return UNICODE_ALIAS_FOR_OMEGA;
  }
  if (s == "theta") {
    return UNICODE_ALIAS_FOR_THETA;
  }
  if (s == "lambda") {
    return UNICODE_ALIAS_FOR_LAMBDA;
  }
  if (s == "strike") {
    return UNICODE_ALIAS_FOR_STRIKE;
  }
  if (s == "diamond_solid") {
    return UNICODE_ALIAS_FOR_DIAMOND_SOLID;
  }
  if (s == "cross") {
    return UNICODE_ALIAS_FOR_CROSS;
  }
  if (s == "cursor") {
    return UNICODE_ALIAS_FOR_CURSOR;
  }
  if (s == "block") {
    return UNICODE_ALIAS_FOR_BLOCK;
  }
  if (s == "pointer") {
    return UNICODE_ALIAS_FOR_POINTER;
  }
  if (s == "wtf") {
    return UNICODE_ALIAS_FOR_UNKNOWN;
  }
  if (s == "newline") {
    return UNICODE_ALIAS_FOR_NEWLINE;
  }
  if (s == "halo") {
    return UNICODE_ALIAS_FOR_HALO;
  }

  if (s.size() > 1) {
    ERR("Bad unicode string [%s]", s.c_str());
  }

  return s[ 0 ];
}

wchar_t unicode_alias_to_char(wchar_t in)
{
  switch (in) {
    case UNICODE_0x20 : return UNICODE_0x20; /* 32	    */
    case UNICODE_0x21 : return UNICODE_0x21; /* 33	  ! */
    case UNICODE_0x22 : return UNICODE_0x22; /* 34	  " */
    case UNICODE_0x23 : return UNICODE_0x23; /* 35	  # */
    case UNICODE_0x24 : return UNICODE_0x24; /* 36	  $ */
    case UNICODE_0x25 : return UNICODE_0x25; /* 37	  % */
    case UNICODE_0x26 : return UNICODE_0x26; /* 38	  & */
    case UNICODE_0x27 : return UNICODE_0x27; /* 39	  \  */
    case UNICODE_0x28 : return UNICODE_0x28; /* 40	  ( */
    case UNICODE_0x29 : return UNICODE_0x29; /* 41	  ) */
    case UNICODE_0x2a : return UNICODE_0x2a; /* 42	  * */
    case UNICODE_0x2b : return UNICODE_0x2b; /* 43	  + */
    case UNICODE_0x2c : return UNICODE_0x2c; /* 44	  , */
    case UNICODE_0x2d : return UNICODE_0x2d; /* 45	  - */
    case UNICODE_0x2e : return UNICODE_0x2e; /* 46	  . */
    case UNICODE_0x2f : return UNICODE_0x2f; /* 47	  / */
    case UNICODE_0x30 : return UNICODE_0x30; /* 48	  0 */
    case UNICODE_0x31 : return UNICODE_0x31; /* 49	  1 */
    case UNICODE_0x32 : return UNICODE_0x32; /* 50	  2 */
    case UNICODE_0x33 : return UNICODE_0x33; /* 51	  3 */
    case UNICODE_0x34 : return UNICODE_0x34; /* 52	  4 */
    case UNICODE_0x35 : return UNICODE_0x35; /* 53	  5 */
    case UNICODE_0x36 : return UNICODE_0x36; /* 54	  6 */
    case UNICODE_0x37 : return UNICODE_0x37; /* 55	  7 */
    case UNICODE_0x38 : return UNICODE_0x38; /* 56	  8 */
    case UNICODE_0x39 : return UNICODE_0x39; /* 57	  9 */
    case UNICODE_0x3a : return UNICODE_0x3a; /* 58	  : */
    case UNICODE_0x3b : return UNICODE_0x3b; /* 59	  ; */
    case UNICODE_0x3c : return UNICODE_0x3c; /* 60	  < */
    case UNICODE_0x3d : return UNICODE_0x3d; /* 61	  = */
    case UNICODE_0x3e : return UNICODE_0x3e; /* 62	  > */
    case UNICODE_0x3f : return UNICODE_0x3f; /* 63	  ? */
    case UNICODE_0x40 : return UNICODE_0x40; /* 64	  @ */
    case UNICODE_0x41 : return UNICODE_0x41; /* 65	  A */
    case UNICODE_0x42 : return UNICODE_0x42; /* 66	  B */
    case UNICODE_0x43 : return UNICODE_0x43; /* 67	  C */
    case UNICODE_0x44 : return UNICODE_0x44; /* 68	  D */
    case UNICODE_0x45 : return UNICODE_0x45; /* 69	  E */
    case UNICODE_0x46 : return UNICODE_0x46; /* 70	  F */
    case UNICODE_0x47 : return UNICODE_0x47; /* 71	  G */
    case UNICODE_0x48 : return UNICODE_0x48; /* 72	  H */
    case UNICODE_0x49 : return UNICODE_0x49; /* 73	  I */
